{
    "Pepper_bell_Bacterial_spot":{
            "Symptoms and signs":"The typical symptoms of bacterial spot arenecrotic lesions on leaves, stems, and fruit.The symptoms on leaves first appear as small,water-soaked spots that expand into angular or irregular necrotic lesions 1/16 to 1/4 inch in diameter. These lesions have light gray centers and dark brown margins surrounded by narrow yellow halos. Tissue in the center of a lesion can dry and break away, giving a shot-hole appearance (Figure 1). Under continuous rain and wet conditions, lesions expand fast and remain dark-green and water-soaked without becoming necrotic (Figure 2).Several lesions may coalesce and result in large necrotic lesions. Eventually the leaves turn yellow and drop off prematurely. Spots on fruit begin as pale-green and water-soaked areas, which eventually become raised and scab-like lesions (1/16 to 1/8 inch), which render the fruit unmarketable.",
            "Disease":"The pathogen is seedborne, being present within the seed or on its surface. The pathogen also is considered to be soilborne, but survival is always associated with the presence of susceptible crop debris. Contaminated seed and diseased transplants serve as key avenues of long-distance spread of the pathogen and serve as primary inoculum in fields. Once initial infections occur, the disease can spread rapidly from a few infected plants to an entire seedbed field. During very humid conditions, bacteria may ooze out from lesions and spread from plant to plant by overhead irrigation, rain splashing, or by handling diseased plants. Long periods of high relative humidity and free water on leaf surfaces are favorable for development of bacterial spot.",
            "Management":"Resistance of pepper to bacterial leaf spot is race-specific. Several races with differing levels of pathogenicity have been identified in the pathogen. Therefore, effective use of resistant varieties requires knowing which races of the pathogen are likely to be present in a certain area. Races 1 and 3 have been found in the northern U.S. The sweet bell pepper varieties Patriot, Boynton Bell, Commandant, Brigadier, and Socrates are resistant to both races 1 and 3. Seed treatment should be used to reduce possible transmission of the pathogen. Two types of seed treatment have been found to be effective for bacterial spot. Seed may be treated in a household bleach solution (2 parts bleach and 8 parts water). Seed wrapped in a cheesecloth bag are soaked in the bleach solution, and continuously agitated for 40 minutes. After the treatment, rinse seed in running water for 5 minutes, and dry seed thoroughly on a paper towel. Seed treatment with bleach solution is effective for contamination of pathogens on the seed surface only. Hot-water treatment can kill bacteria on the inside and on the outside of seed. It is critical to pre-warm wrapped seed in the 100 F water bath for 10 min, and then treat seed at 125° F for 30 minutes. It is very important to continually monitor the temperature of the water bath with an accurate thermometer. After treatment, dip the bag in cold water to stop the heat treatment and dry the seed as described above.For a preventative purpose, use pathogen-free seed and transplants. Rotate with non-host plants to avoid carryover of the pathogen on volunteers and crop residue. Do not rotate pepper with tomato, eggplant, or potato, and do not grow these crops together. Avoid overhead irrigation. Do not work on wet plants in fields. Control nightshade, horsenettle, jimsonweed, and all other solanaceous weeds. A spray program should be initiated before the early stages of disease development. The products registered for use in Connecticut are copper-containing compounds (such as copper hydroxide and copper sulfate). Maneb can be mixed with copper products to enhance control of bacterial spot."
    },
    "Pepper_bell_healthy":{
            "Symptoms and signs":"Bacterial spot occurs on peppers and tomatoes. Many of the disease features are similar for both crops. The focus of the information presented here is on pepper. Worldwide, 16.5 million metric tons (36 million tons) of peppers are grown for fresh consumption and for use in condiments. For many people in the U.S., the bell-shaped pepper fruit is the most familiar (Figure 1); however, non-bell-type peppers (Figure 2) are more widely grown.Bacteria attack the foliage, stems, and fruit of peppers and tomatoes. On peppers, lesions may form on fruit, including the peduncle (Figure 3), but the major crop loss (Figure 4) results from shedding of blossoms and young, developing fruit. Fruit that remain are usually non-marketable because of poor quality. They may have lesions and are often misshapen and damaged from excessive exposure to the sun as a result of defoliation. This can result in sunscald on the fruit (Figure 5). Diseased leaves drop prematurely resulting in extensive defoliation. As newly emerging leaves become infected and defoliation of older, diseased leaves continues, plants possess leaves mostly on their upper stems (Figure 6). Generally, defoliation is more common for peppers than for tomatoes. Because the diseased foliage often remains on tomato plants, affected plants may have a scorched appearance (Figure 7).",
            "DISEASE DEVELOPMENT":"The bacteria have a very limited survival period of days to weeks in the soil, and thus their survival is almost always in association with debris from infected or diseased plants. The pathogens have been reported to persist in association with roots of wheat as well as a few weed species; weeds, however, are considered to play only a minor role in pathogen survival. Volunteer tomato plants and possibly pepper volunteers are potentially important sources of inoculum in some locations. In colder regions where vegetative material is killed, the bacteria survive very poorly, if at all. In these areas, reintroduction is primarily on contaminated seed or infected transplants.The pathogen can survive in association with seed, either externally or internally. On externally infested seed, cotyledons may become infected upon contact with the seed coat and exhibit lesions soon after emerging from the soil (Figure 15). Bacteria are then readily splashed to new foliage and to other plants. Disease is a particular threat in transplant production (Figure 16). Transplant beds favor bacterial spot development because plants are irrigated frequently, crowded together, and humidity is typically high. In a 24-hr period, the bacteria can multiply rapidly and produce millions of cells. The risk of transmission on the seed surface can be reduced by treating seed with sodium or calcium hypochlorite or trisodium phospate (TSP). Killing bacteria that may be carried internally is more difficult. Chemical or heat treatments that kill the pathogen within the seed also can injure or kill the seed. Although bacterial spot is a disease of warm, humid regions, it can develop in arid, irrigated regions. The bacteria can be spread by rain or by overhead irrigation. Bacteria also may be spread in water droplets when pesticides are applied with high-pressure sprayers. Bacteria enter through stomata on the leaf surfaces and through wounds on the leaves and fruit, such as those caused by abrasion from sand particles and wind. Prolonged periods of high relative humidity favor infection and disease development. Symptom development is delayed or eliminated when relative humidity remains low for several days after infection.",
            "Management":"The primary management strategy of bacterial spot begins with use of certified pathogen-free seed and disease-free transplants. The bacteria do not survive well once host material has decayed, so crop rotation is recommended. Once the bacteria are introduced into a field or greenhouse, the disease is very difficult to control. Pepper plants are routinely sprayed with copper-containing bactericides to maintain a 'protective' cover on the foliage and fruit (Figure 17). Strains of the pathogen resistant to copper and/or streptomycin are fairly common and can be detected by plating bacteria on media containing these compounds (Figure 18). Genes encoding resistance to copper and streptomycin can be borne on plasmids (extrachromosomal DNA) contained in the bacterial cells. The presence of these genes on plasmids allows for the rapid spread of resistance to other non-resistant bacteria.Although resistant cultivars are available and widely planted, there are strains of the pathogen able to overcome all of the currently known major resistance genes (Figure 19). Currently, three independently segregating genes form the basis for resistance to bacterial spot in commercial cultivars of bell peppers. Strains of the pathogen that react differently with the resistance genes of the pepper plant are designated as races. With the report of a fourth resistance gene in 1998, 11 races can be differentiated using peppers. Resistance has not been as easy to find and use in tomato. Formerly, four races were recognized that infect tomato. With the proposed taxonomic changes, these have assumed species status (Jones, et al. 2004). Biological control options for bacterial spot are limited. However, a biological control method that uses bacterial viruses (bacteriophages) that specifically kill the bacterial pathogens is now available. Treatments with these bacteriophages, marketed as “AgriPhage,” have been successful in reducing disease, especially in greenhouse transplant production."
    },
    "Potato_Early_blight":{
            "Symptoms and signs":"Early blight is primarily a disease of stressed or senescing plants. Symptoms appear first on the oldest foliage. Affected leaves develop circular to angular dark brown lesions 0.12 to 0.16 inch (3–4 mm) in diameter. Concentric rings often form in lesions to produce characteristic target-board effect. Severely infected leaves turn yellow and drop. Infected tubers show a brown, corky dry rot.",
            "Disease":"Between crops, the early blight fungus can overwinter on potato refuse in the field, in soil, on tubers, and on other solanaceous plants. Infection occurs when spores of the fungus come in contact with susceptible leaves and sufficient free moisture is present. Spore germination and infection are favored by warm weather and wet conditions from dew, rain, or sprinkler irrigation. Alternately, wet and dry periods with relatively dry, windy conditions favor spore dispersal and disease spread. Tubers can be infected as they are lifted through the soil at harvest. If sufficient moisture is present, spores germinate and infect the tubers.",
            "Management":"Early blight can be minimized by maintaining optimum growing conditions, including proper fertilization, irrigation, and management of other pests. Grow later maturing, longer season varieties. Fungicide application is justified only when the disease is initiated early enough to cause economic loss. Watch for disease symptoms during routine monitoring, and keep records of your results (example form—PDF). When justified, apply fungicides as soon as symptoms appear; continued protection requires application at 7- to 10-day intervals."
    },
    "Potato_healthy":{
        "Symptoms and signs":"-",
        "Disease":"-",
        "Management":"Good position"
    },
    "Potato_Late_blight":{
            "Symptoms and signs":"The first symptoms of late blight in the field are small, light to dark green, circular to irregular-shaped water-soaked spots (Figure 1). These lesions usually appear first on the lower leaves. Lesions often begin to develop near the leaf tips or edges, where dew is retained the longest. During cool, moist weather, these lesions expand rapidly into large, dark brown or black lesions, often appearing greasy (Figure 2). Leaf lesions also frequently are surrounded by a yellow chlorotic halo (Figure 3).The lesions are not limited by leaflet veins, and as new infections occur and existing infections coalesce, entire leaves can become blighted and killed within just a few days. The lesions also may be present on petioles and stems of the plant (Figure 4).During active growth, especially in cool, wet weather, a white mildew-appearing area is visible at the edge of the lesions (Figure 5) or along petioles (Figure 6). This is the area where the late blight pathogen actively is producing spores. As the weather changes to warm and dry, these lesions become dry, stop sporulating and become tan.A pale green to yellow border often surrounds the lesions. Severely infected fields often produce a distinct odor. Late blight infection of tubers is characterized by irregularly shaped, slightly depressed areas that can vary considerably in size and in color from brown to purplish on the skin (Figure 8). These symptoms may be less obvious on russet and red-skinned cultivars.A tan to reddish-brown, dry, granular rot is found under the skin in the discolored areas and extending into the tuber usually less than ½ inch (Figure 9). The extent of the rotting in a tuber depends on the susceptibility of the cultivar, temperature and length of time after the initial infection.The margin of the diseased tissue is not always distinct but can be, particularly in seed potatoes that have been stored at cold storage temperatures (Figure 10). However, the margin between late blight-infected tissue and healthy tissue frequently is marked by a brown fingerlike extension into the healthy flesh of the tuber.",
            "Disease":"P. infestans, the cause of late blight, is a heterothallic fungal-like pathogen, meaning two mating types are required for sexual reproduction and are referred to as A1 and A2. The pathogen needs living plant or tuber tissue to survive in the field in the absence of oospores. However, in some areas of the world where both mating types of the pathogen are present, a sexual spore that is capable of soil survival is produced. Although soil survival is not known to occur definitively in the U.S., anecdotal evidence indicates that sexual combination has occurred, suggesting soil survival is possible. Infected potato tubers are the primary source of inoculum for P. infestans. That includes potatoes in storage, infected tubers missed during harvest that remain unfrozen during the winter (volunteers), seed tubers and infected cull piles, and P. infestans on other host plants. The pathogen can be transmitted from infected seed tubers to newly emerging potato plants, where it produces airborne spores that can move to neighboring plants. The late blight pathogen is favored by free moisture and cool to moderate temperatures. Night temperatures of 50 to 60 F and day temperatures of 60 to 70 F are most favorable for disease development. Free water from rain, dew and overhead irrigation sprinkler irrigation all provide the water necessary for pathogen infection and development. Spores develop in three to five days and require 12 hours of free moisture for infection to occur. Lesions on leaves and stems become visible as small flecks within a few days after infection. The lesions expand to water-soaked, gray-green areas on the leaf and sporulate if conditions are favorable. The spores are carried by wind and rain to healthy plants, where the disease cycle begins again. A disease cycle can occur every five to seven days, resulting in rapid spread and movement of late blight. Tubers are infected by spores washed from lesions to the soil. Spores germinate and swim to tubers in free water and infect primarily the eyes. Tuber infections are characterized by patches of brown to purple discoloration on the potato skin. Cutting just below the skin reveals a dark, reddish-brown, dry, corky rot.",
            "Management":" Effective control of this disease requires implementation of an integrated disease management approach. Late blight is a community disease, and effective management requires community management. Here are methods to help control the disease: Destroy all cull and volunteer potatoes. Plant late blight-free seed tubers. Do not mix seed lots because cutting can transmit late blight. Use a seed piece fungicide treatment labeled for control of late blight (current list of fungicides can be found in the North Dakota Field Crop Plant Disease Management Guide, PP622). Recommended seed treatments include Revus, Reason and mancozeb. Avoid planting problem areas that may remain wet for extended periods or may be difficult to spray (the field near the center of the pivot, along powerlines and tree lines). Avoid excessive and/or nighttime irrigation. Eliminate sources of inoculum such as hairy nightshade weed species and volunteer potatoes. Scout fields regularly, especially in low, wet areas, along tree lines, at the center of the pivot and other areas that remain wet for longer periods where late blight first may occur. Use foliar fungicides on a regular and continuing schedule. Once late blight is present, only foliar fungicide applications can manage late blight in the field. (A current list of fungicides can be found in the NDSU “Fungicide Guide,” PP622). Keep up to date on late blight forecasts. In our region, the NDSU Potato Blightline (https://ndawn.ndsu.nodak.edu/potato-late-blight.html) operates during the growing season and provides weekly late blight updates and forecasting. Quickly destroy hot spots of late blight. Kill vines completely two to three weeks before harvest. Consider adding a fungicide when vine killing if there is late blight pressure. Applying phosphorous acid to potatoes after harvest and before piling can prevent infection and the spread of late blight in storage. Monitor home garden and market tomatoes near you for late blight. Late blight can move from these local sources to potato fields."
        },
    "Tomato_Bacterial_spot":{
            "Symptoms and signs":"Bacterial spot develops on seedlings and mature plants. On seedlings, infections may cause severe defoliation. On older plants, infections occur primarily on older leaves and appear as water-soaked areas. Leaf spots turn from yellow or light green to black or dark brown. Older spots are black, slightly raised, superficial and measure up to 0.3 inch (7.5 mm) in diameter. Larger leaf blotches may also occur, especially on the margins of leaves. Symptoms on immature fruit are at first slightly sunken and surrounded by a water-soaked halo, which soon disappears. Fruit spots enlarge, turn brown, and become scabby.",
            "Disease":"The bacterial spot bacterium persists from one season to the next in crop debris, on volunteer tomatoes, and on weed hosts such as nightshade and groundcherry. The bacterium is seedborne and can occur within the seed and on the seed surface. The pathogen is spread with the seed or on transplants. Secondary spread within a field occurs by splashing water from sprinkler irrigation or rain. Infection is favored by high relative humidity and free moisture on the plant. Symptoms develop rapidly at temperatures of 68°F (20°C) and above. Night temperatures of 61°F (16°C) or below suppress disease development regardless of day temperatures. Some pathogen strains are virulent on either tomato or pepper and some may be virulent on both.",
            "Management":"Cultural practices and preventive sprays of copper help to manage bacterial spot. Bacterial spot occurs commonly in tomatoes throughout California. Using pathogen-free seed and disease-free transplants, when possible, is the best way to avoid bacterial spot on tomato. Avoiding sprinkler irrigation and cull piles near greenhouse or field operations, and rotating with a nonhost crop also helps control the disease. Cultural controls and some copper formulations are acceptable for use on organically certified produce. Copper-containing bactericides provide partial disease control. Apply at first sign of disease and repeat at 10- to 14-day intervals when warm, moist conditions prevail. Copper is strictly a protectant and must be applied before an infection period occurs. "
    },
    "Tomato_Early_blight":{
                "Symptoms and signs":"Early blight is primarily a disease of stressed or senescing plants. Symptoms appear first on the oldest foliage. Affected leaves develop circular to angular dark brown lesions 0.12 to 0.16 inch (3–4 mm) in diameter. Concentric rings often form in lesions to produce characteristic target-board effect. Severely infected leaves turn yellow and drop. Infected tubers show a brown, corky dry rot.",
                "Disease":"Between crops, the early blight fungus can overwinter on potato refuse in the field, in soil, on tubers, and on other solanaceous plants. Infection occurs when spores of the fungus come in contact with susceptible leaves and sufficient free moisture is present. Spore germination and infection are favored by warm weather and wet conditions from dew, rain, or sprinkler irrigation. Alternately, wet and dry periods with relatively dry, windy conditions favor spore dispersal and disease spread. Tubers can be infected as they are lifted through the soil at harvest. If sufficient moisture is present, spores germinate and infect the tubers.",
                "Management":"Early blight can be minimized by maintaining optimum growing conditions, including proper fertilization, irrigation, and management of other pests. Grow later maturing, longer season varieties. Fungicide application is justified only when the disease is initiated early enough to cause economic loss. Watch for disease symptoms during routine monitoring, and keep records of your results (example form—PDF). When justified, apply fungicides as soon as symptoms appear; continued protection requires application at 7- to 10-day intervals."
    },
    "Tomato_healthy":{
        "Symptoms and signs":"-",
        "Disease":"-",
        "Management":"Good position"
    },
    "Tomato_Late_blight":{
                "Symptoms and signs":"The first symptoms of late blight in the field are small, light to dark green, circular to irregular-shaped water-soaked spots (Figure 1). These lesions usually appear first on the lower leaves. Lesions often begin to develop near the leaf tips or edges, where dew is retained the longest. During cool, moist weather, these lesions expand rapidly into large, dark brown or black lesions, often appearing greasy (Figure 2). Leaf lesions also frequently are surrounded by a yellow chlorotic halo (Figure 3).The lesions are not limited by leaflet veins, and as new infections occur and existing infections coalesce, entire leaves can become blighted and killed within just a few days. The lesions also may be present on petioles and stems of the plant (Figure 4).During active growth, especially in cool, wet weather, a white mildew-appearing area is visible at the edge of the lesions (Figure 5) or along petioles (Figure 6). This is the area where the late blight pathogen actively is producing spores. As the weather changes to warm and dry, these lesions become dry, stop sporulating and become tan.A pale green to yellow border often surrounds the lesions. Severely infected fields often produce a distinct odor. Late blight infection of tubers is characterized by irregularly shaped, slightly depressed areas that can vary considerably in size and in color from brown to purplish on the skin (Figure 8). These symptoms may be less obvious on russet and red-skinned cultivars.A tan to reddish-brown, dry, granular rot is found under the skin in the discolored areas and extending into the tuber usually less than ½ inch (Figure 9). The extent of the rotting in a tuber depends on the susceptibility of the cultivar, temperature and length of time after the initial infection.The margin of the diseased tissue is not always distinct but can be, particularly in seed potatoes that have been stored at cold storage temperatures (Figure 10). However, the margin between late blight-infected tissue and healthy tissue frequently is marked by a brown fingerlike extension into the healthy flesh of the tuber.",
            "Disease":"P. infestans, the cause of late blight, is a heterothallic fungal-like pathogen, meaning two mating types are required for sexual reproduction and are referred to as A1 and A2. The pathogen needs living plant or tuber tissue to survive in the field in the absence of oospores. However, in some areas of the world where both mating types of the pathogen are present, a sexual spore that is capable of soil survival is produced. Although soil survival is not known to occur definitively in the U.S., anecdotal evidence indicates that sexual combination has occurred, suggesting soil survival is possible. Infected potato tubers are the primary source of inoculum for P. infestans. That includes potatoes in storage, infected tubers missed during harvest that remain unfrozen during the winter (volunteers), seed tubers and infected cull piles, and P. infestans on other host plants. The pathogen can be transmitted from infected seed tubers to newly emerging potato plants, where it produces airborne spores that can move to neighboring plants. The late blight pathogen is favored by free moisture and cool to moderate temperatures. Night temperatures of 50 to 60 F and day temperatures of 60 to 70 F are most favorable for disease development. Free water from rain, dew and overhead irrigation sprinkler irrigation all provide the water necessary for pathogen infection and development. Spores develop in three to five days and require 12 hours of free moisture for infection to occur. Lesions on leaves and stems become visible as small flecks within a few days after infection. The lesions expand to water-soaked, gray-green areas on the leaf and sporulate if conditions are favorable. The spores are carried by wind and rain to healthy plants, where the disease cycle begins again. A disease cycle can occur every five to seven days, resulting in rapid spread and movement of late blight. Tubers are infected by spores washed from lesions to the soil. Spores germinate and swim to tubers in free water and infect primarily the eyes. Tuber infections are characterized by patches of brown to purple discoloration on the potato skin. Cutting just below the skin reveals a dark, reddish-brown, dry, corky rot.",
            "Management":" Effective control of this disease requires implementation of an integrated disease management approach. Late blight is a community disease, and effective management requires community management. Here are methods to help control the disease: Destroy all cull and volunteer potatoes. Plant late blight-free seed tubers. Do not mix seed lots because cutting can transmit late blight. Use a seed piece fungicide treatment labeled for control of late blight (current list of fungicides can be found in the North Dakota Field Crop Plant Disease Management Guide, PP622). Recommended seed treatments include Revus, Reason and mancozeb. Avoid planting problem areas that may remain wet for extended periods or may be difficult to spray (the field near the center of the pivot, along powerlines and tree lines). Avoid excessive and/or nighttime irrigation. Eliminate sources of inoculum such as hairy nightshade weed species and volunteer potatoes. Scout fields regularly, especially in low, wet areas, along tree lines, at the center of the pivot and other areas that remain wet for longer periods where late blight first may occur. Use foliar fungicides on a regular and continuing schedule. Once late blight is present, only foliar fungicide applications can manage late blight in the field. (A current list of fungicides can be found in the NDSU “Fungicide Guide,” PP622). Keep up to date on late blight forecasts. In our region, the NDSU Potato Blightline (https://ndawn.ndsu.nodak.edu/potato-late-blight.html) operates during the growing season and provides weekly late blight updates and forecasting. Quickly destroy hot spots of late blight. Kill vines completely two to three weeks before harvest. Consider adding a fungicide when vine killing if there is late blight pressure. Applying phosphorous acid to potatoes after harvest and before piling can prevent infection and the spread of late blight in storage. Monitor home garden and market tomatoes near you for late blight. Late blight can move from these local sources to potato fields."
        
    },
    "Tomato_Leaf_Mold":{
        "Symptoms and signs":"The first signs of leaf mold are, as you might expect, on the leaves themselves, as the topside of the leaves start to develop small gray, yellow, white, or pale green patches. The underside of the leaves begin to develop a fuzzy texture and turn purple. Oftentimes, the fuzz will appear in an olive green color. The fuzzy texture is actually the spores of the mold fungus. The fruit of the tomato plant is rarely infected by leaf mold. As the disease progresses, the infected tissue of the leaves become yellowish-brown and the leaf starts to wither, eventually falling off of the plant altogether. If not treated, the plant will eventually wither and die. Though the fruit and blossoms of the tomato plant are rarely affected by leaf mold, it does occur occasionally. When the fruit or flower is infected, it appears as a black legion on the surface of the fruit or bloom. The black part grows and spreads out, eventually covering over half of the surface area of the flowerhead or fruit. Tomato leaf mold can affect both ripe tomatoes and immature green tomatoes. ",
        "Disease":"Leaf mold is a common fungal disease that affects tomatoes that are cultivated in especially humid environments. Feeding off of the humidity, the mold grows and thrives after attaching itself to the leaves of the tomato plant. Once the mold is noticed, immediate action is required to save the plant, otherwise the foliage will be compromised, which will reduce the amount of tomatoes your plants will yield. Fortunately for tomato growers, this fungal disease is relatively easy to treat and cure. ",
        "Management":"Upon noticing the infected areas, the first step is to let the plants air out and dry. If they are being cultivated in a greenhouse, expose them to dry air conditions, because the humidity that the fungus needs to survive and thrive is dried up in the open air. If the tomatoes are being cultivated outdoors, try to keep the leaves dry when watering the plants. One thing you can do to help keep the leaves as dry as possible is to water in the early morning hours, that way the plant has plenty of time to dry before the sun comes out, which will keep the humidity around the leaves low. You can also try drip irrigation methods, or soak watering methods to attempt to water the soil without ever wetting the leaves of the plant. Another treatment option is fungicidal sprays. When using fungicide sprays, be sure to thoroughly cover all parts of the plant that is above ground, focusing specifically on the underside of leaves. Calcium chloride sprays are among the most highly recommended types for leaf mold. There are a few organic fungicides on the market as well. There are also a handful of natural remedy recipes that you can try that are made out of common household items that can be mixed up in your kitchen and sprayed directly on your tomato crops. An apple-cider and vinegar mix is believed to treat the mold effectively. Corn and garlic spray can also be used to prevent fungi outbreaks before they even occur. There is also a milk-based spray that is touted as an all-natural, helpful cure for leaf mold. "
    },
    "Tomato_Septoria_leaf_spot":{
        "Symptoms and signs":"Septoria leaf spot is caused by the fungus Septoria lycopersici. This fungus can attack tomatoes at any stage of development, but symptoms usually first appear on the older, lower leaves and stems when plants are setting fruit. Symptoms usually appear on leaves, but can occur on petioles, stems, and the calyx. The first symptoms appear as small, water-soaked, circular spots 1/16 to 1/8' in diameter on the undersides of older leaves. The centers of these spots then turn gray to tan and have a dark-brown margin. The spots are distinctively circular and are often quite numerous. As the spots age, they sometimes enlarge and often coalesce. A diagnostic feature of this disease is the presence of many dark-brown, pimple-like structures called pycnidia (fruiting bodies of the fungus) that are readily visible in the tan centers of the spots. When spots are numerous, affected leaves turn yellow and eventually shrivel up, brown, and drop off. Defoliation usually starts on the oldest leaves and can quickly spread progressively up the plant toward the new growth. Significant losses can result from early leaf-drop and often leads to the subsequent sunscalding of the fruit when plants are prematurely defoliated. Septoria leaf spot is favored by warm, wet, humid conditions. Although the fungus can survive in or on seed and in weed hosts, the main source of inoculum is from leaf fragments and other plant debris from diseased plants that 'overwinter' in the soil. Under wet conditions, spores (also called conidia) of the fungus are produced in the pycnidia. These spores are spread to healthy tomato leaves by windblown water, splashing rain, overhead irrigation systems, hands and clothing of pickers, cultivation equipment, and several types of insects such as Colorado potato beetles, flea beetles, tomato worms, and aphids. Following this initial spread and when free moisture is present on the leaves, the spores germinate, infect the tomato tissues, and spots usually appear within 5 days. Pycnidia subsequently develop in these new spots, more spores are produced, secondary cycles of infection begin, and the disease spreads.",
        "Disease":"Septoria leaf spot, also called Septoria blight, occurs throughout the United States and worldwide wherever tomatoes are grown. This disease can be quite destructive and crop losses of up to 100% have been reported in heavily defoliated fields. Septoria leaf spot is primarily a disease of tomato, but it has been reported on other Solanaceous hosts including eggplant, potato, petunia, horsenettle, and black nightshade",
        "Management":"The effects of Septoria leaf spot can be minimized by following a multifaceted approach to disease management that includes sanitary, cultural, and chemical methods. It is very important to eliminate initial sources of inoculum by removing or destroying as much of the tomato debris as possible after harvest in the fall. Alternatively, in large fields where plant removal is not practical, plant debris can be covered and buried by deep plowing. These simple sanitary practices can significantly reduce disease development the following year since they remove sources of the fungus that overwinter in the soil. During the growing season, it is important to start with healthy, disease-free transplants. If infected plants are found, rogue the seedlings before transplanting them into the field. It is also helpful to practice crop rotation with a non-Solanaceous crop, if possible. Since water is important to both the spread and development of this disease, it is helpful to avoid overhead watering or to water early in the day so that the leaves dry more quickly than with nighttime watering. In addition, it is helpful to avoid working with plants when they are wet. Although resistance to Septoria leaf spot has been tentatively identified in several lines of tomato used for breeding, no cultivars with resistance are commercially available to date. Fungicides are very effective for control of Septoria leaf spot and applications are often necessary to supplement the control strategies previously outlined. The fungicides chlorothalonil and mancozeb are labeled for homeowner use. Since these are protectant materials, they should be applied as soon as symptoms are observed and repeated as necessary when conditions are favorable for disease development and spread. In Connecticut, the first sprays are usually needed by mid-July. The fungicide labels contain information on dosage rates, spray intervals, days-to-harvest intervals, and safety precautions."
    },
    "Tomato_Spider_mites_Two_spotted_spider_mite":{
        "Symptoms and signs":"Adult TSSM feed by sucking chlorophyll out of the leaves, creating blotchy pale to reddish-brown spots. Feeding injury often gives the top leaf surfaces a mottled or speckled, dull appearance. Leaves then turn yellow and drop. Large populations produce visible webbing that can completely cover the leaves. In the field, spider mites are favored by hot, dry, and dusty conditions, which also aggravates injury by stressing the plant. Damage is often underestimated since the wounds and the pest are not apparent to our eyes without close inspection. Leaves become blotched with pale yellow, reddish brown spots ranging from small to large areas on both upper and lower leaf surfaces. Other symptoms caused by either severe or constant attack include distorted leaves, overall loss of plant vigor (in spite of adequate moisture and nutrition), whitening or spotting of leaves, yellowing of the plant or some of the leaves, and in some cases loss of foliage and death.",
        "Disease":"The two-spotted spider mite is the most common mite species that attacks vegetable and fruit crops in New England. Spider mites can occur in tomato, eggplant, potato, vine crops such as melons, cucumbers, and other crops. Two-spotted spider mites are one of the most important pests of eggplant. They have up to 20 generations per year and are favored by excess nitrogen and dry and dusty conditions. Outbreaks are often caused by the use of broad-spectrum insecticides which interfere with the numerous natural enemies that help to manage mite populations. As with most pests, catching the problem early will mean easier control.",
        "Management":"Watch for spider mites in greenhouses where vegetable transplants are growing. Also scout eggplants in the field. Checking for mites must be done by examining foliage. Adult mites are not found on sticky cards. Mites often develop as localized infestations on particular groups of plants such as beans or tomatoes. Sample plants by turning over leaves and with a hands-free magnifier (Optivisor) or hand lens, check for the presence of spider mites as well as symptoms or webbing. Adult females are approximately 1/50-inch long, slightly orange or pale green in color with two dark spots on their body. All mobile stages are able to pierce plant tissue with their mouth-parts and remove plant fluids. Saliva injected during feeding may also cause discoloration, necrosis or abnormalities on leaves, stems and fruits. Most spider mites are found on the underside of leaves. A 10X hand lens is key for identifying the mite species, but injury, webbing, and the tiny adults can be seen with the naked eye."
    },
    "Tomato_Target_Spot":{
        "Symptoms and signs":"The target spot fungus can infect all above-ground parts of the tomato plant. Plants are most susceptible as seedlings and just before and during fruiting. The initial foliar symptoms are pinpoint-sized, water-soaked spots on the upper leaf surface (Figure 1a). The spots develop into small, necrotic lesions that have light brown centers and dark margins. These symptoms may be confused with symptoms of bacterial spot.1,2,8 The lesions increase in size, become circular with gray to pale brown centers. As the lesions enlarge, they can develop darker concentric circles, hence, the name target spot (Figure 1c). The concentric circles are similar to those seen on early blight lesions. Yellow halos can form around the lesions on some varieties. Lesions can coalesce, forming large blighted areas on the leaflets, and infected leaves may drop prematurely.4,5,6,8 Target spot infections typically start on the older, lower leaves in the inner canopy. Thus, the initial symptoms may not be noticed by the grower, making early detection difficult. The disease progresses upward, causing defoliation of the inner canopy, a condition known as “melting-out”.Initial symptoms on stems and petioles are pinpoint lesions that become brown and elongated to oblong. The lesions can expand to the point where they girdle the stem or petiole, resulting in the collapse of leaves or leaflets.2 The lesions on the fruit start as slightly sunken, brown flecks. The fruit lesions enlarge (Figure 2a), forming large, circular, sunken craters with pale-brown centers and concentric circles (Figure 2b). The tissue in the fruit lesions may crack with time.1,2,8 When severe, numerous leaf and stem lesions form on plants, causing collapse of tissues and, eventually, plant death.",
        "Disease":"The target spot pathogen survives between crops on plant debris and alternate host plants, including weed hosts. The fungus produces spores, which are spread by wind and wind-blown and splashing rain.2,6,9 Infection of tomato plants requires high humidity levels, periods of leaf wetness from 16 to 44 hours and temperatures between 60° and 90°F. Optimal disease development occurs at temperatures between 68° and 82°F.2,8 Target spot tends to be more severe on plants with lush canopies that dry more slowly. Fruit wounded by hail or blowing sand are predisposed to infection.1,4,8",
        "Management":"Cultural practices for target spot management include improving airflow through the canopy by wider plant spacing and avoiding over-fertilizing with nitrogen, which can cause overly lush canopy formation. Pruning suckers and older leaves in the lower canopy can also increase airflow and reduce leaf wetness.1,5,9 Avoid planting tomatoes near old plantings. Inspect seedlings for target spot symptoms before transplanting. Manage weeds, which may serve as alternate hosts, and avoid the use of overhead irrigation. Destroy crop residues shortly after the final harvest, and rotate away from tomato and other known hosts for at least three years. Resistance to target spot is not available in commercial tomato varieties, although partial resistance has been observed in wild species of tomato. The primary strategy used to manage target spot on tomato is the regular application of fungicides. Applications should begin before symptoms appear when conditions are favorable for infection and disease development. Fungicides may need to be applied at regular intervals (every 10 to 14 days is common) depending on the label directions of the products used. Full coverage of all plant surfaces is needed for the best control of target spot.Many fungicides are registered to control of target spot on tomatoes. Growers should consult regional disease management guides for recommended products.10 Products containing chlorothalonil, mancozeb, and copper oxychloride have been shown to provide good control of target spot in research trials.1,9 The strobilurin fungicides azoxystrobin and pyraclostrobin, the fungicide boscalid, and the systemic acquired resistance (SAR) elicitor acibenzolar-S-methyl have also been shown to provide good control of target spot. The labels of many of the fungicides registered for target spot control indicate that the products should be tank-mixed or alternated with fungicides with different modes of action to prevent the development of fungicide-resistant strains of the target spot pathogen. This is especially important when using strobilurin fungicides because they are at high risk for resistance development. Strains of C. cassiicola that are resistant to strobilurin fungicides have been detected in tomato and other crops.2,4,8 Successful, long-term management of target spot on tomato will require the use of integrated programs that include cultural and chemical management strategies."
    },
    "Tomato_Tomato_mosaic_virus":{
        "Symptoms and signs":"Early infection may cause plants to look yellow and generally stunted. Dark and light green leaves mottling. There may be twisted, deformed, or diminished leaves. At warm temperatures, certain cultivars may show signs of dead leaf tissue. Possible uneven ripening of fruits. Decreased total fruit yield and average fruit size. Fruit with irregular, off-color spots that can be either elevated or depressed. Fruits may exhibit browning just beneath the skin (brownwall)",
        "Disease":"More than a dozen viruses have been found to infect tomatoes. Viruses might be difficult to distinguish from one another. The human eye is only capable of determining that a virus is likely to be the source of a problem. Only by sending a sample to a lab can a definitive diagnosis be made. Tomato mosaic virus (ToMV) is the most prominent virus in Florida. Viruses can induce symptoms on leaves and in fruit. Only laboratory tests can identify plant viruses. Plant viruses cannot be cured, hence management efforts should be directed toward reducing virus spread. The virus can be spread from plant to plant or by infected seeds or insects. Thrips and aphids are major vectors for some viruses. Normal plant care tasks, such as tying, removing suckers, and harvesting, can spread viruses via hands, equipment, and clothing.",
        "Management":"If you have any plants in your garden that you suspect may be infected, remove them immediately to prevent the spread of the virus. Don’t throw them in the compost. Infected plants should be uprooted entirely and burned. Always go through reliable retailers while purchasing transplants.Make sure to inspect transplants before buying them. Be sure there are no obvious symptoms before selecting a transplant.Infected plants often exhibit no visible signs of illness, therefore it’s important to frequently disinfect tools, ideally between each plant.There are currently no effective chemical solutions against any other virus. The control of aphids and thrips during the production of transplants can aid in preventing the spread of plant viruses."
    },
    "Tomato_Tomato_YellowLeaf_Curl_Virus":{
        "Symptoms and signs":"Identify and remove infected plants. As soon as you see a plant with symptoms of TYLCV, remove it from the garden and destroy it. This will help to prevent the spread of the virus to other plants. Control whiteflies. Whiteflies are the main vector of TYLCV, so it is important to control their populations. Insecticidal soaps, neem oil, and pyrethrins are all effective against whiteflies. Spray the undersides of the leaves thoroughly, where whiteflies tend to congregate. Use row covers. Row covers can help to protect plants from whiteflies and other pests. Place row covers over plants as soon as they are transplanted.",
        "Disease":"Tomato Yellow Leaf Curl Virus (TYLCV) is a serious viral disease of tomatoes that is transmitted by whiteflies. There is no cure for TYLCV, but there are spoat treatments that can help to control whiteflies and prevent the spread of the virus.",
        "Management":"The best way to control TYLCV is to prevent it from happening in the first place. Here are some tips for preventing TYLCV.Start with healthy plants from a reputable nursery or garden center.Plant tomatoes in a sunny spot with well-drained soil.Water tomatoes regularly, but avoid overwatering.Fertilize tomatoes according to the instructions on the fertilizer label. Mulch around tomatoes to help retain moisture and suppress weeds. Inspect plants regularly for signs of pests and diseases."
    }


}